Конфигурация/Documents/СделкаСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СделкаСНедвижимостью</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ГрафикиПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расторжение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПраваНаНедвижимость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравНаНедвижимость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Срок</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимостиПоДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СведенияОРегистрацииПраваСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СведенияОРегистрацииПраваСобственности</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСвидетельства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСвидетельства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СделкаСНедвижимостью/Ext/ManagerModule.bsl
Функция ПолучитьОстатокЗадолженности(Ссылка, Период)
	
	Результат = Новый Структура("Сумма, ЭтоЗадолженностьПоОплате", 0, Неопределено);
	
	ДанныеСделкиСНедвижимостью = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВидПраваНаНедвижимость, ВидСделки, Организация, СчетДоверительногоУправления");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 				  	  	Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка",							Ссылка);
	
	ЭтоСделкаКуплиПродажи = ДанныеСделкиСНедвижимостью.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность;
	
	Если ЭтоСделкаКуплиПродажи Тогда
		
		Запрос.УстановитьПараметр("Организация", 					ДанныеСделкиСНедвижимостью.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ДанныеСделкиСНедвижимостью.СчетДоверительногоУправления);
		
	#Область ТекстЗапроса
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Сумма > 0
			|			ТОГДА ВложенныйЗапрос.ТипЗадолженности
			|		КОГДА ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|	КОНЕЦ КАК ТипЗадолженности,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Сумма > 0
			|			ТОГДА ВложенныйЗапрос.Сумма
			|		ИНАЧЕ -ВложенныйЗапрос.Сумма
			|	КОНЕЦ КАК СуммаОстаток
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВложенныйЗапрос.ТипЗадолженности КАК ТипЗадолженности,
			|		ВложенныйЗапрос.ОснованиеЗадолженности КАК ОснованиеЗадолженности,
			|		СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
			|			ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК ОснованиеЗадолженности,
			|			ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма
			|		ИЗ
			|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|					&Период,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью)
			|						И Основание = &Ссылка) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ВЫБОР
			|				КОГДА ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Документ.СделкаСНедвижимостью).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			КОНЕЦ,
			|			УсловияСделокСНедвижимостьюСрезПоследних.Основание,
			|			-УсловияСделокСНедвижимостьюСрезПоследних.Сумма
			|		ИЗ
			|			РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|					&Период,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И Основание = &Ссылка) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|		ГДЕ
			|			НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|			И УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка)
			|			И УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности = ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.ПустаяСсылка)) КАК ВложенныйЗапрос
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВложенныйЗапрос.ОснованиеЗадолженности,
			|		ВложенныйЗапрос.ТипЗадолженности) КАК ВложенныйЗапрос";
		
	#КонецОбласти	
	
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&Период, Основание = &Ссылка) КАК ЗадолженностиПоДенежнымСредствамОстатки";
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Результат.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
		Если ЭтоСделкаКуплиПродажи Тогда
			Результат.ЭтоЗадолженностьПоОплате = ДанныеСделкиСНедвижимостью.ВидСделки = Перечисления.ВидыСделок.Продажа 
												И ВыборкаДетальныеЗаписи.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская
												ИЛИ ДанныеСделкиСНедвижимостью.ВидСделки = Перечисления.ВидыСделок.Покупка 
												И ВыборкаДетальныеЗаписи.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
		Иначе
			Результат.ЭтоЗадолженностьПоОплате = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПлановыеВыплатыПоСделкеСНедвижимостью(Ссылка, Период) Экспорт
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ОснованиеЗадолженности", Новый ОписаниеТипов("ДокументСсылка.СделкаСНедвижимостью"));
	ТаблицаРезультат.Колонки.Добавить("ДатаРегистрации", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаРезультат.Колонки.Добавить("ЭтоДенежныйПоток", Новый ОписаниеТипов("Булево"));
	
	ОстатокСтруктура = ПолучитьОстатокЗадолженности(Ссылка, Период);
	ОстатокЗадолженности = ОстатокСтруктура.Сумма;
	
	Рубли = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
	ДатаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Дата");
	
	Запрос = Новый Запрос;
	
	Если ОстатокСтруктура.ЭтоЗадолженностьПоОплате Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ГрафикиПлатежейСрезПоследних.ДатаПлатежа КАК Дата,
			|	ГрафикиПлатежейСрезПоследних.Сумма КАК Сумма,
			|	ГрафикиПлатежейСрезПоследних.Основание.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Аренда)
			|		И ГрафикиПлатежейСрезПоследних.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка) КАК ЭтоПолучениеВДолгосрочнуюАренду
			|ИЗ
			|	РегистрСведений.ГрафикиПлатежей.СрезПоследних(&Период, Основание = &Ссылка) КАК ГрафикиПлатежейСрезПоследних
			|ГДЕ
			|	ГрафикиПлатежейСрезПоследних.Действует
			|
			|УПОРЯДОЧИТЬ ПО
			|	ГрафикиПлатежейСрезПоследних.ДатаПлатежа УБЫВ";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК Дата,
			|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма КАК Сумма
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|			&Период,
			|			(Организация, СчетДоверительногоУправления, Основание) В
			|				(ВЫБРАТЬ
			|					СделкаСНедвижимостью.Организация КАК Организация,
			|					СделкаСНедвижимостью.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|					СделкаСНедвижимостью.Ссылка КАК Ссылка
			|				ИЗ
			|					Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
			|				ГДЕ
			|					СделкаСНедвижимостью.Ссылка = &Ссылка)) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|
			|УПОРЯДОЧИТЬ ПО
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи УБЫВ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ОстатокЗадолженности = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если ОстатокЗадолженности > ВыборкаДетальныеЗаписи.Сумма Тогда
			СуммаПотока = ВыборкаДетальныеЗаписи.Сумма
		Иначе
			СуммаПотока = ОстатокЗадолженности;
		КонецЕсли;
		
		СтрокаПотока = ТаблицаРезультат.Добавить();
		СтрокаПотока.ОснованиеЗадолженности = Ссылка;
		СтрокаПотока.ДатаРегистрации = ДатаРегистрации;
		//для сделки долгосрочной аренды рабочие дни учтены в графике платежей
		Если ВыборкаДетальныеЗаписи.ЭтоПолучениеВДолгосрочнуюАренду Тогда
			СтрокаПотока.Период = ВыборкаДетальныеЗаписи.Дата;
		Иначе
			СтрокаПотока.Период = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ВыборкаДетальныеЗаписи.Дата, 1);
		КонецЕсли;
		//хардкод - постановление о переносе выходных на 2022 год действует с 25.09.21
		Если Период < Дата(2021,9,25) И СтрокаПотока.Период = Дата(2022,5,4) Тогда
			СтрокаПотока.Период = Дата(2022,5,3);
		КонецЕсли;
		СтрокаПотока.Сумма = СуммаПотока;
		СтрокаПотока.Валюта = Рубли;
		СтрокаПотока.ЭтоДенежныйПоток = Истина;
		
		ОстатокЗадолженности = ОстатокЗадолженности - СуммаПотока;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьВидАктива(ВидПраваНаНедвижимость)
	
КонецФункции

Функция ПолучитьВидЗадолженности(ВидПраваНаНедвижимость, ВидСделки, Отказ) Экспорт
	
	Если ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность Тогда
		Возврат Справочники.ВидыЗадолженности.ПоСделкеСНедвижимостью;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт Тогда
		Возврат Справочники.ВидыЗадолженности.ПоИнвестконтракту;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
		Возврат Справочники.ВидыЗадолженности.ПоДДУ;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
		И ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Возврат Справочники.ВидыЗадолженности.ПоПолучениюВАренду;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для  " + ВидПраваНаНедвижимость + " не удалось определить вид задолженности по сделке с недвижимостью",,,,Отказ);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУчетныйАктив(ВидПраваНаНедвижимость, ВидСделки, Отказ) Экспорт
	
	Если ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт Тогда
		Возврат Справочники.УчетныеАктивы.Инвестконтракты;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
		Возврат Справочники.УчетныеАктивы.ДДУ;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
		И ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Возврат Справочники.УчетныеАктивы.ПраваАренды;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для  " + ВидПраваНаНедвижимость + " не удалось определить вид учетного актива по сделке с недвижимостью",,,,Отказ);
	КонецЕсли;
	
КонецФункции
